tests/fixture-edt/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <posting>Allow</posting>
  <attributes>
    <name>Контрагент</name>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
    </attributes>
    <attributes>
      <name>Количество</name>
    </attributes>
  </tabularSections>
</mdclass:Document>

tests/fixture-edt/src/Documents/ЗаказКлиента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Для Каждого СтрокаТовары Из Запрос.Выполнить().Выгрузить() Цикл
		Остаток = Новый Запрос;
		Остаток.Текст = "ВЫБРАТЬ СвободныеОстатки.Количество КАК Количество ИЗ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстатки";
	КонецЦикла;

	HTTPСоединение = Новый HTTPСоединение("shop.example");
	Ответ = HTTPСоединение.Получить(Новый HTTPЗапрос("/stock"));

КонецПроцедуры
